In [248]:
import pandas as pd

In [249]:
df = pd.read_csv("data.csv")
df_col = df.copy()

In [250]:
df_col.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [251]:
#re-ordering columns
df_col_reordering = df_col[['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked','Name']]
df_col_reordering.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,"Braund, Mr. Owen Harris"
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"Heikkinen, Miss. Laina"
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,"Allen, Mr. William Henry"

In [252]:
# df_col_reordering["new"]= df_col_reordering["Name"].str.split(", ", expand=True).loc[:,0]
df_col["First_Name"] = df_col["Name"].str.split(", ", expand=True)[0]
df_col["Last_Name_Title"] = df_col["Name"].str.split(", ", expand=True)[1]
df_col.drop(columns=["Name"], inplace=True)
df_col.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Last_Name_Title
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [253]:
# title = df_col["Last_Name"].str.split(".", n=1, expand=True)
# title.loc[:,0].unique()

In [254]:
df_col["Pass_Title"] = df_col["Last_Name_Title"].str.split(". ", expand=True)[0]
df_col["Last_Name"] = df_col["Last_Name_Title"].str.split(". ", n=1, expand=True)[1]
df_col.drop(columns=["Last_Name_Title"], inplace=True)
df_col.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Pass_Title,Last_Name
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr,Owen Harris
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss,Laina
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr,William Henry

In [255]:
df_col_fixed = df_col[['PassengerId', 'Survived', 'Pclass', 'Pass_Title', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'First_Name',
       'Last_Name']]
df_col_fixed.rename(columns={"Sex":"Gender"}, inplace=True)
df_col_fixed.head()

,PassengerId,Survived,Pclass,Pass_Title,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Last_Name
0,1,0,3,Mr,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Owen Harris
1,2,1,1,Mrs,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,John Bradley (Florence Briggs Thayer)
2,3,1,3,Miss,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Laina
3,4,1,1,Mrs,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Jacques Heath (Lily May Peel)
4,5,0,3,Mr,male,35.0,0,0,373450,8.0500,NaN,S,Allen,William Henry